import { Component, OnInit } from '@angular/core';
import { Router } from '@angular/router';

@Component({
  selector: 'app-terms',
  templateUrl: './terms.component.html',
  styleUrls: ['./terms.component.scss']
})
export class TermsComponent implements OnInit {

  constructor(private router:Router) { }

  termsText = [
    "1.	זהו תקנון לאתר סוגרים חשבון . ",
    "2.	הרכישה באמצעות האתר כפופה לתנאים המפורטים בתקנון זה. ",
    "3. עצם רכישת המוצר באתר תהווה הצהרה מצד הלקוח כי קרא את הוראות תקנון זה, הבין אותן והסכים להן. התקנון מהווה חוזה מחייב בין המשתמש לבין האתר. כלומר, השימוש באתר על תכניו והשירותים הניתנים בו, מוצעים למשתמש בכפוף לקבלת והסכמת המשתמש לכל התנאים הכלולים בתקנון זה. ",
    "4.	הנהלת האתר רשאית לעדכן את תנאי התקנון מעת לעת.",
    '5. הרכישה באתר הינה באמצעות כרטיס אשראי בלבד והעסקה תתבצע לאחר אישורה ע"י חברת האשראי.',
    "6.	המשתמש מודע לכך שישנה עמלה חודשית ו/או עמלה חד פעמית על עסקאות שונות שמבוצעות באתר, והכל בהתאם לשיטת ההתקשרות של המשתמש עם האתר.",
    "7. הרישום באתר הוא לשימוש האישי והבלעדי של המשתמש אשר אינו רשאי להעביר את הרשאת השימוש לאדם אחר כלשהו.",
    '8. האתר שומר לעצמו את הזכות להפסיק את שיווק ומכירת המוצרים בכל עת ו/או שינוי מסלולים וכיוצ"ב.',
    '9.	המשתמש מודע לכך שעם לחיצה על כפתור ה\'שלח\', לא ניתן יהיה לבטל את עסקת האשראי. ',
    "10. סוגרים חשבון  רשאית להשתמש במידע המופיע בטופס על מנת להביא לך את המידע והשירותים המבוקשים ו/או מידע על שירותים נוספים.",
    "11. החברה נוקטת באמצעי זהירות מקובלים על מנת לשמור, ככל האפשר, על סודיות המידע. בכל מקרה, לא תהא החברה אחראית לכל נזק מכל סוג שהוא, ישר או עקיף, שייגרם ללקוח, אם מידע זה יאבד ו/או יעשה בו שימוש לא מורשה.",
    "12. כל המידע או תוצאות המידע כתוצאה משימוש באתר, והמופיע באתר מוצע למשתמש כמות שהוא (As Is). לא תהיה ללקוח כל טענה או דרישה כלפי האתר בגין תכונות השירות, מאפייניו, מגבלותיו או התאמתו לצרכיו ולדרישותיו. ",
    "13. עם השימוש באתר, המשתמש מודע לכך שיכולים להיווצר עיכובים בקבלת תוצאות מאתרים אחרים אשר אליהם מקשר אתר סוגרים חשבון , ולפיכך אתר סוגרים חשבון  אינו אחראי לפעילויות של אתרים אחרים, אלא רק מסייע לקישור אליהם, כך באופן כזה בו קישור מופיע לאתר אחר, ולכן קישור זה אינו מהווה ערובה לתכנים באתרים אלה מבחינת מהימנות, שלמות, או מכל בחינה אחרת. ",
    "14. אתר סוגרים חשבון  אינו אחראי לבדיקות נוספות אחרות לצורך ההתקשרות העסקית שייתכן ויש צורך לבצע מול גורמים אחרים או אף מול אותם גורמים שעוברים בדיקה בסיוע אתר סוגרים חשבון. ",
    "15. האתר אינו נותן שירות משפטי מכל סוג שהוא, והשימוש באתר הינו באחריות המשתמש בלבד.  ",
    "16. האתר פועל לפי חוק, וכל משתמש המסכים לתקנון זה מאשר בזאת כי הוא ישתמש באתר לפי חוק.  ",
    "17. במקרה של תביעה בהקשר לאתר זה, בית המשפט המתאים יהיה בירושלים. ",
    "18. כל זכויות הקניין הרוחני באתר זה הינן רכושה הבלעדי של סוגרים חשבון . ",
    "19. אין להעתיק, לשכפל, להפיץ, לפרסם או להשתמש בכל דרך אחרת במידע כלשהו מן האתר אלא אם ניתנה הסכמה לכך מראש ובכתב מטעם בעלי האתר.",
  ]

  ngOnInit() {
  }

  getBack(){
    this.router.navigate(['/register']);
  }

}
